app/views/games/show.html.erb

SELECT "guesses".* FROM "guesses" WHERE "guesses"."game_id" = $1 ORDER BY "guesses"."created_at" ASC  [["game_id", 62]]
SELECT COUNT(*) FROM "guesses" WHERE "guesses"."game_id" = $1  [["game_id", 152]]
---
        <div class="game-info">
            Deneme: <%= @game.guesses.count %>/6

SELECT COUNT(*) FROM "guesses" WHERE "guesses"."game_id" = $1  [["game_id", 151]]
---
            <div class="notice">
                TEBRİKLER. Kelimeyi <%= @game.guesses.count %>. denemede buldunuz: <strong><%= @game.secret_word.upcase %></strong>