app/views/games/show.html.erb

            <div class="notice">
                TEBRİKLER. Kelimeyi <%= @game.guesses.count %>. denemede buldunuz: <strong><%= @game.secret_word.upcase %></strong>
---
SELECT COUNT(*) FROM "guesses" WHERE "guesses"."game_id" = $1  [["game_id", 115]]