app/controllers/games_controller.rb

  def show
    @game = Game.find_by!(token: params[:token])
---
SELECT "games".* FROM "games" WHERE "games"."token" = $1 LIMIT $2  [["token", "[FILTERED]"], ["LIMIT", 1]]

  def current_session_current_period_game
    return nil unless session[:game_ids]

    current_period = DailyWord.current_period_date
    session_ids = session[:game_ids]

    Game.where(id: session_ids, game_period: current_period).first
---
SELECT "games".* FROM "games" WHERE "games"."id" = $1 AND "games"."game_period" = $2 ORDER BY "games"."id" ASC LIMIT $3  [["id", 187], ["game_period", "2025-08-01"], ["LIMIT", 1]]