app/controllers/games_controller.rb

INSERT INTO "games" ("secret_word", "attempts_count", "created_at", "updated_at", "user_id", "token", "game_period") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    current_period = DailyWord.current_period_date
    existing_game = current_session_current_period_game

    if existing_game
      redirect_to game_token_path(existing_game.token)
      return
    end

    @game = Game.new(secret_word: Game.current_word)

    if @game.save
      session[:game_tokens] ||= []
      session[:game_tokens] << @game.token

SELECT "guesses".* FROM "guesses" WHERE "guesses"."game_id" = $1 ORDER BY "guesses"."created_at" ASC  [["game_id", 62]]
---
  def show
    unless session[:game_tokens]&.include?(@game.token)
      redirect_to root_path
      return
    end

    @guesses = @game.guesses.order(:created_at)

INSERT INTO "guesses" ("word", "game_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["word", "selam"], ["game_id", 108], ["created_at", "2025-07-30 09:30:07.293171"], ["updated_at", "2025-07-30 09:30:07.293171"]]
SELECT "guesses".* FROM "guesses" WHERE "guesses"."game_id" = $1  [["game_id", 62]]
SELECT COUNT(*) FROM "guesses" WHERE "guesses"."game_id" = $1  [["game_id", 99]]
SELECT COUNT(*) FROM "guesses" WHERE "guesses"."game_id" = $1  [["game_id", 142]]
SELECT COUNT(*) FROM "guesses" WHERE "guesses"."game_id" = $1  [["game_id", 158]]
---
  def guess
    return redirect_to game_token_path(@game.token), alert: 'Oyun bitti' if @game.completed?

    word = params[:word].to_s.downcase.strip

    if word.length != 5
      return redirect_to game_token_path(@game.token), alert: 'Sadece 5 harfli kelime giriniz.'
    end

    unless valid_word?(word)
      return redirect_to game_token_path(@game.token), alert: "'#{word}' geçersiz kelime. Lütfen geçerli bir Türkçe kelime giriniz."
    end

    @new_guess = @game.guesses.build(word: word)

    if @new_guess.save
      if @game.won?
        redirect_to game_token_path(@game.token), notice: " Tebrikler kelimeyi #{@game.guesses.count} denemede buldunuz: #{@game.secret_word}"
      elsif @game.lost?
        redirect_to game_token_path(@game.token), alert: " Oyun bitti. Kelime: #{@game.secret_word}"
      else
        feedback = @new_guess.feedback
        correct_count = feedback.count('correct')
        present_count = feedback.count('present')

        if correct_count > 0 && present_count > 0
          message = " #{correct_count} doğru, #{present_count} yanlış yerde. Kalan: #{6 - @game.guesses.count}"
        elsif correct_count > 0
          message = " #{correct_count} harf doğru yerde. Kalan: #{6 - @game.guesses.count}"
        elsif present_count > 0
          message = " #{present_count} harf var ama yanlış yerde. Kalan: #{6 - @game.guesses.count}"
        else
          message = " Hiçbir harf eşleşmedi. Kalan: #{6 - @game.guesses.count}"

SELECT "games".* FROM "games" WHERE "games"."token" = $1 LIMIT $2  [["token", "[FILTERED]"], ["LIMIT", 1]]
---
  def set_game
    @game = Game.find_by!(token: params[:token])

SELECT "games".* FROM "games" WHERE "games"."token" IN ($1, $2) AND "games"."game_period" = $3 ORDER BY "games"."id" ASC LIMIT $4  [["token", "[FILTERED]"], ["token", "[FILTERED]"], ["game_period", "2025-07-31"], ["LIMIT", 1]]
---
  def current_session_current_period_game
    return nil unless session[:game_tokens]

    current_period = DailyWord.current_period_date
    session_tokens = session[:game_tokens]

    Game.where(token: session_tokens, game_period: current_period).first