app/controllers/games_controller.rb

  def guess
    return redirect_to @game, alert: 'Oyun bitti' if @game.completed?

    word = params[:word].to_s.downcase.strip

    # Kelime uzunluğu kontrolü
    if word.length != 5
      return redirect_to @game, alert: 'Sadece 5 harfli kelime giriniz.'
    end

    @new_guess = @game.guesses.build(word: word)

    if @new_guess.save
      if @game.won?
        redirect_to @game, notice: " Tebrikler kelimeyi #{@game.guesses.count} denemede buldunuz: #{@game.secret_word}"
---
INSERT INTO "guesses" ("word", "game_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["word", "selam"], ["game_id", 62], ["created_at", "2025-07-24 13:40:03.116621"], ["updated_at", "2025-07-24 13:40:03.116621"]]
SELECT COUNT(*) FROM "guesses" WHERE "guesses"."game_id" = $1  [["game_id", 138]]