app/models/game.rb

  def generate_token
    loop do
      self.token = SecureRandom.urlsafe_base64(8)
      break unless Game.exists?(token: self.token)
---
SELECT 1 AS one FROM "games" WHERE "games"."token" = $1 LIMIT $2  [["token", "[FILTERED]"], ["LIMIT", 1]]